{
  "header": {
    "settings": "налаштування",
    "home": "Головна"
  },
  "navigation": {
    "about": "Про мене",
    "skills": "Навички",
    "projects": "Проєкти",
    "contact": "Контакти"
  },
  "welcomeSection": {
    "preTitle": "Привіт, я",
    "title": "Сергій Мачковський",
    "description": "Front-end розробник",
    "download_cv": "Завантажити CV"
  },
  "about": {
    "title": "Про мене",
    "description": "Я Front-end розробник, який захоплюється перетворенням ідей у цифрові рішення. Мені подобається створювати чисті, адаптивні інтерфейси, які одночасно функціональні та естетично привабливі.\n\nЗа природою я допитливий, люблю досліджувати сучасні тренди дизайну та веб-технології. Моя мета — писати чистий, масштабований та зручний для користувача код."
  },
  "skills": {
    "title": "Мої навички",
    "languages": "Мови",
    "languagesList": [
      {
        "title": "Українська",
        "level": "рідна"
      },
      {
        "title": "Російська",
        "level": "вільно"
      },
      {
        "title": "Англійська",
        "level": "початковий"
      }
    ],
    "education": "Освіта",
    "vdpu": {
      "title": "Вінницький державний педагогічний університет",
      "imgAlt": "Логотип Вінницького державного педагогічного університету"
    },
    "itStep": {
      "title": "Академія IT Step",
      "imgAlt": "Логотип Академії IT Step"
    },
    "workExperience": "Досвід роботи",
    "Sonik": {
      "title": "Sonik Technology",
      "imgAlt": "Логотип компанії Sonik Technology",
      "july": "Липень",
      "august": "Серпень"
    },
    "selfEmployed": {
      "title": "Самозайнятий",
      "imgAlt": "Іконка портфеля",
      "september": "Вересень",
      "may": "Травень"
    }
  },
  "projects": {
    "title": "Мої Проєкти",
    "project1": {
      "title": "Workout",
      "description": "Цей проєкт був розроблений як частина мого проміжного оцінювання в IT Step Academy. Він створений із використанням HTML, CSS та чистого JavaScript, а макет базується на дизайні з Figma.\n\nМета полягала у точному відтворенні візуальної структури з використанням навичок фронтенд-розробки, таких як маніпуляції з DOM, стилізація за допомогою Flexbox та інтерактивність через події JavaScript.\n\nЦя робота допомогла мені покращити розуміння семантичного HTML, чистої CSS-архітектури та перетворення дизайн-прототипів у адаптивні веб-сторінки."
    },
    "project2": {
      "title": "Food tuck",
      "description": "Цей проєкт був розроблений як мій випускний на IT Step Academy. Він створений з використанням React, за дизайном з Figma.\n\nМетою було реалізувати сучасний адаптивний вебдодаток, застосовуючи основи React, компонентну архітектуру та управління станом.\n\nРобота над цим проєктом покращила мої навички у розробці на React і вміння перетворювати дизайн-прототипи у функціональні інтерфейси."
    },
    "project3": {
      "title": "Language Space",
      "description": "Цей навчальний проєкт був розроблений у співпраці з іншим розробником із використанням HTML, CSS та JavaScript. Метою було попрактикувати командну роботу та поглибити знання у використанні Git.\n\nМоя відповідальність у проєкті включала створення та стилізацію основних секцій сторінки: шапки (header), головного екрану, блоку «Про нас», а також секцій для вивчення іспанської та англійської мов. Для кращої модульності та організації коду я застосовував шаблони Handlebars (HBS).\n\nЦей досвід допоміг мені покращити навички командної розробки, роботи із системою контролю версій Git та використання шаблонізаторів, таких як Handlebars.\n\nНещодавно я перезалив проєкт на GitHub для виправлення відображення зображень — код залишив без змін, щоб було видно мій поточний прогрес порівняно з попередньою версією."
    },
    "project4": {
      "title": "Pokedex",
      "description": "Цей проєкт був створений у рамках навчального відеокурсу з Next.js. Це невеликий застосунок, мета якого — ознайомлення з основами роботи з фреймворком.\n\nДодаток отримує дані з відкритого API PokeAPI та реалізує просту функцію фільтрації для пошуку покемонів.\n\nПроєкт допоміг мені освоїти базові поняття Next.js, такі як маршрутизація на основі сторінок, робота з API та клієнтська інтерактивність."
    },
    "project5": {
      "title": "To-Do List",
      "description": "Це мій новий невеликий проєкт, створений для практики роботи з React, React hooks та пропсами. Додаток дозволяє користувачам додавати, виконувати та видаляти завдання у простому та інтуїтивному інтерфейсі. Для звукових ефектів при взаємодії я використав бібліотеку `use-sound`. Дизайн розроблений мною, виконаний у теплому акварельному стилі, що додає м’якості та дружності. Проєкт допоміг мені покращити навички керування станом у React, компонування компонентів та роботу з зовнішніми бібліотеками."
    }
  }
}